---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GeomVisibilityParam
source: html/277cc72e-a370-1e89-3418-30e922929b72.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GeomVisibilityParam Property

"Visibility/Graphics Overrides"

## Syntax (C#)
```csharp
public static ForgeTypeId GeomVisibilityParam { get; }
```